# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,9, 9,4, 13,13]  # 4
  - [10,13, 16,30, 33,23]  # 8
  - [15,18, 21,35, 38,28]  # 16
  - [30,61, 62,45, 59,119] # 32
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 1, 1]],  # 0-P1/1
   [-1, 1, Conv_CBAM, [128, 3, 2]],  # 1-P2/2
   [-1, 3, C3, [128]],
   [-1, 1, Conv_CBAM, [128, 3, 2]],  # 3-P3/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv_CBAM, [256, 3, 2]],  # 5-P4/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv_CBAM, [512, 3, 2]],  # 7-P5/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv_CBAM, [1024, 3, 2]],  # 9-P6/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 11
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  
   [-1, 3, C3, [512, False]],  

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 23 (P3/4-mini)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 26 (P4/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 29 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 32 (P5/32-large)

   [[23,26,29,32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
